bases/SBB_Broker/projects/ACCOUNTING-18422 Форма 0420454 НКЛ/Исходники/Reports/ОтчетДляПроверкиИПодтвержденияДанныхПоСделкам0420454.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетДляПроверкиИПодтвержденияДанныхПоСделкам0420454</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bases/SBB_Broker/projects/ACCOUNTING-18422 Форма 0420454 НКЛ/Исходники/Reports/ОтчетДляПроверкиИПодтвержденияДанныхПоСделкам0420454/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Перем ТекущийОбъект;

&НаСервере
Функция ТекущийОбъект()
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Отчет");
	КонецЕсли; 
	
	Возврат ТекущийОбъект;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Дата") Тогда 
		Отчет.Дата = Параметры.Дата;
	Иначе 
		Отчет.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда 
		Отчет.Организация = Параметры.Организация;
	Иначе 
		Отчет.Организация = ПараметрыСеанса.Организация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.Организация) Тогда
		ТекстОшибки = "Не заполнена организация отчета";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.Дата) Тогда
		ТекстОшибки = "Не заполнена дата отчета";
	КонецЕсли;
	
	Если ТекстОшибки <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ТабличныеДокументы = ТекущийОбъект().РезультатФормированияОтчета();
	
	Для Каждого ТабличныйДокумент Из ТабличныеДокументы Цикл
		
		ИмяТабДок = "Результат" + ТабличныйДокумент.Ключ;
		
		ЭтаФорма[ИмяТабДок].Очистить();
		ЭтаФорма[ИмяТабДок] = ТабличныйДокумент.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для выгрузки файла";
	
	Если Диалог.Выбрать() Тогда
		Отчет.КаталогФайла = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Если Не ЗначениеЗаполнено(Отчет.КаталогФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан путь к файлу!");
		Возврат;
	КонецЕсли;
	
	Попытка
		ExcelApp = Новый COMОбъект("Excel.Application");
		ExcelApp.DisplayAlerts = 0;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при запуске приложения MS Excel." + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ОбщаяКнига = ExcelApp.WorkBooks.Add();
	ОбщаяКнига.Sheets(1).Name = "Удалить";
	
	СохранитьРазделВExcel("РезультатКлиентскиеСделкиФонд", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатСобственныеСделкиФонд", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатКлиентскиеСделкиВал", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатСобственныеСделкиВал", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатОбязательстваПоКомиссиямС", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатОбязательстваПоКомиссиямБез", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатОбязательстваПоРасходамС", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатОбязательстваПоРасходамБез", ExcelApp, ОбщаяКнига);
	СохранитьРазделВExcel("РезультатСобственныеАктивыНаФОРТС", ExcelApp, ОбщаяКнига);
	
	//Удалим ненужный лист в общем файле
	ОбщаяКнига.Sheets("Удалить").Delete();
	
	ИмяФайла = "ПКЛ_" + Формат(Отчет.Дата, "ДФ=ddMMyyyy") + " (проверочный).xlsx";
	Путь = СокрЛП(Отчет.КаталогФайла);
	Если Прав(Путь, 1) <> "\" Тогда 
		Путь = Путь + "\";
	КонецЕсли;
	ПолноеИмяФайла = Путь + ИмяФайла;
	
	ОбщаяКнига.SaveAs(ПолноеИмяФайла);
	
	ExcelApp.Quit();
	Книга = Неопределено;
	ОбщаяКнига = Неопределено;
	ExcelApp = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Файл успешно сохранен.");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРазделВExcel(ИмяТабличногоДокумента, ExcelApp, ОбщаяКнига)
	
	ИндексЛиста = ОбщаяКнига.Sheets.Count;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ЭтаФорма[ИмяТабличногоДокумента].Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Книга = ExcelApp.WorkBooks.Open(ИмяВременногоФайла);
	Книга.Sheets(1).Copy(ОбщаяКнига.Sheets(ИндексЛиста));
	Книга.Close();
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;
	
	//Переименуем лист в общем файле
	ОбщаяКнига.Sheets(ИндексЛиста).Name = Элементы[ИмяТабличногоДокумента].Заголовок;
	
КонецПроцедуры
